<img src = "img/images.png" style="height:85px;">

<div style="text-align:center">
    Enero 20, 2025

 # Pandas 
    
    
<img src ="img/Python-Logo.jpg" style="height:355px;">
    
</div>

*Esteban Sánchez*

## 1. Pandas

- Librería estándar de Python para datos tabulares.
- Ofrece dos estructuras: Series (1-D) y DataFrame (2-D).

In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
pd.__version__

'2.3.3'

## 2. Series
- Vector + índice personalizable.
- Se comporta como array de NumPy y como diccionario: se accede por posición o por etiqueta, se puede iterar, filtrar con mascaras, aplicar funciones de NumPy y castear a lista, array o dict.
- Operaciones aritméticas alinean los índices; falta de coincidencia → NaN.

In [3]:
paises = pd.Series(['España' , 'Andorra' , 'Gibraltar' , 'Portugal' , 'Francia'])
print(paises)

0       España
1      Andorra
2    Gibraltar
3     Portugal
4      Francia
dtype: object

In [4]:
paises = pd.Series(['España' , 'Andorra' , 'Gibraltar' , 'Portugal' , 'Francia'],
                  index = range(10,60,10))
print(paises)

10       España
20      Andorra
30    Gibraltar
40     Portugal
50      Francia
dtype: object

In [5]:
ciudades = pd.Series(['Barcelona' , 'Madrid' , 'Valencia' , 'Sevilla'] , 
                    index =['a', 'b' , 'c' , 'd'])  #Especificando el indice
print(ciudades)

a    Barcelona
b       Madrid
c     Valencia
d      Sevilla
dtype: object

In [6]:
ciudades.name = 'Ciudades con 2 equipos en primera división' #Nombre de Serie

ciudades.index.name = 'ID' #Nombre de la columna de indices 

print(ciudades)

ID
a    Barcelona
b       Madrid
c     Valencia
d      Sevilla
Name: Ciudades con 2 equipos en primera división, dtype: object

In [7]:
print (ciudades[2])
print (ciudades['c'])
print (ciudades['c'] == ciudades[2])

Valencia
Valencia
True

C:\Users\USER\AppData\Local\Temp\ipykernel_19640\870621518.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print (ciudades[2])
C:\Users\USER\AppData\Local\Temp\ipykernel_19640\870621518.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print (ciudades['c'] == ciudades[2])

## 3. Comportamiento similar a ndarray

In [8]:
print(ciudades[ ['a','c'] ])
print(ciudades[ [0,3] ])

ID
a    Barcelona
c     Valencia
Name: Ciudades con 2 equipos en primera división, dtype: object
ID
a    Barcelona
d      Sevilla
Name: Ciudades con 2 equipos en primera división, dtype: object

C:\Users\USER\AppData\Local\Temp\ipykernel_19640\1121753603.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(ciudades[ [0,3] ])

In [9]:
print(ciudades [:'c']) # incluye ambos extremos con el indice semantico
print(ciudades [:2])

ID
a    Barcelona
b       Madrid
c     Valencia
Name: Ciudades con 2 equipos en primera división, dtype: object
ID
a    Barcelona
b       Madrid
Name: Ciudades con 2 equipos en primera división, dtype: object

In [10]:
lista = list(ciudades[:'c'])

print(lista)
print(type(lista))

['Barcelona', 'Madrid', 'Valencia']
<class 'list'>

In [11]:
type(ciudades[:'c'])

pandas.core.series.Series

In [12]:
import numpy as np

ciudades_2 = np.array(ciudades[:'c'])
print(ciudades_2)
print(type(ciudades_2))

['Barcelona' 'Madrid' 'Valencia']
<class 'numpy.ndarray'>

In [13]:
lista = dict(ciudades[:'c'])
print(lista)

{'a': 'Barcelona', 'b': 'Madrid', 'c': 'Valencia'}

In [14]:
#uso de mask

fibonacci = pd.Series ([0,1,1,2,3,5,8,13,21])

print(fibonacci)

mask = fibonacci > 10
print(mask)
print(fibonacci[mask])

dst = pd.Series([13,21])

print(dst)
dst.equals(fibonacci)

fb = fibonacci[mask]

fb.reset_index(drop=True, inplace=True)

print(fb)

dst.equals(fb)

0     0
1     1
2     1
3     2
4     3
5     5
6     8
7    13
8    21
dtype: int64
0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8     True
dtype: bool
7    13
8    21
dtype: int64
0    13
1    21
dtype: int64
0    13
1    21
dtype: int64

True

In [15]:
import numpy as np 

print(np.sum(fibonacci))

54

In [16]:
#filtrar con np.where

distancias =pd.Series ([12.1,np.nan, 12.8,76.9,6.1,7.2])

distancias_validas = np.where(pd.notnull(distancias) , distancias,2)

print(distancias_validas)
print(type(distancias_validas))

[12.1  2.  12.8 76.9  6.1  7.2]
<class 'numpy.ndarray'>

#### 3.0.1 Iteración

In [17]:
#iteracion sobre elemento

for value in fibonacci :
    print('Valor: ' + str(value))
for index in fibonacci.index:
    print('Indice: ' + str(index))

Valor: 0
Valor: 1
Valor: 1
Valor: 2
Valor: 3
Valor: 5
Valor: 8
Valor: 13
Valor: 21
Indice: 0
Indice: 1
Indice: 2
Indice: 3
Indice: 4
Indice: 5
Indice: 6
Indice: 7
Indice: 8

In [18]:
for index , value in fibonacci.items():
    print('Índice:' + str(index) + ' Valor:' + str(value))

Índice:0 Valor:0
Índice:1 Valor:1
Índice:2 Valor:1
Índice:3 Valor:2
Índice:4 Valor:3
Índice:5 Valor:5
Índice:6 Valor:8
Índice:7 Valor:13
Índice:8 Valor:21

In [19]:
for index , value in zip(fibonacci.index , fibonacci):
    print('Índice:' + str(index) + ' Valor:' + str(value))

Índice:0 Valor:0
Índice:1 Valor:1
Índice:2 Valor:1
Índice:3 Valor:2
Índice:4 Valor:3
Índice:5 Valor:5
Índice:6 Valor:8
Índice:7 Valor:13
Índice:8 Valor:21

### 3.1 Series como diccionarios

- Interpreta al índice como clave
- Acepta operaciones para diccionarios

In [20]:
# crear una serie a partir de un diccionario

serie = pd.Series({'Carlos' : 100 , 'Marcos' : 98})

print(serie.index)
print(serie.values)

print(serie)
print(type(serie))

Index(['Carlos', 'Marcos'], dtype='object')
[100  98]
Carlos    100
Marcos     98
dtype: int64
<class 'pandas.core.series.Series'>

In [21]:
serie['Pedro'] = 12
serie ['Pedro'] = 15
del serie['Marcos']
print(serie)

Carlos    100
Pedro      15
dtype: int64

### 3.2 Operaciones entre series

In [22]:
# suma de 2 series

#suma de valores con el mismo indice (NaN no aparece en ambas)
serie1 = pd.Series([10,20,30,40] , index =range(4) )
serie2 = pd.Series([1,2,3] , index =range(3) )

suma = serie1+ serie2
print(suma)

0    11.0
1    22.0
2    33.0
3     NaN
dtype: float64

In [23]:
print(serie1-serie2)

0     9.0
1    18.0
2    27.0
3     NaN
dtype: float64

In [24]:
result = serie1 + serie2

result[pd.isnull(result)] = 0 #mask con `isnull`
print(result)

0    11.0
1    22.0
2    33.0
3     0.0
dtype: float64

#### 3.2.1 Diferencias entre Pandas Series y diccionarios
- Diccionario, es una estructura que relaciona las claves y los valores de forma arbitraria.
-  Series, estructura de forma estricta listas de valores con listas de índice asignado en la posición.
-  Series, es más eficiente para ciertas operaciones que los dicionarios.
-  En las Series los valores de entrada pueden ser listas o Numpy arrays.
-  En Series los índices semánticos pueden ser integers o caracteres, en los valores igual.
-  Series se podría entender entre una lista y un diccionario Python, pero es de una dimensión

## 4. DataFrame
- Datos Tabulares (Fila x Columna)
- Columnas: Series con índices compartidos

In [25]:
#añadir columnas

diccionario = {'Nombre' : ['Maria' , 'Laura' , 'Manuel'] ,
              "Edad" : [34,29,12] }
frame = pd.DataFrame (diccionario, index = ['a', 'b' , 'c'])
display(frame)

   Nombre  Edad
a   Maria    34
b   Laura    29
c  Manuel    12

In [26]:
#ademas de 'index' el parametro 'columns' especifica el numero y orden de las columnas
frame = pd.DataFrame(diccionario , columns =['Nacionalidad' , 'Nombre' , 'Edad' , 'Profesion' , 'Genero'])
display(frame)

  Nacionalidad  Nombre  Edad Profesion Genero
0          NaN   Maria    34       NaN    NaN
1          NaN   Laura    29       NaN    NaN
2          NaN  Manuel    12       NaN    NaN

In [27]:
#acceso a las columnas

nombres = frame['Nombre']
display(nombres)
print(type(nombres))

edad = frame ['Edad']
display(edad)
print(type(edad))

0     Maria
1     Laura
2    Manuel
Name: Nombre, dtype: object

<class 'pandas.core.series.Series'>

0    34
1    29
2    12
Name: Edad, dtype: int64

<class 'pandas.core.series.Series'>

In [28]:
#siempre y cuando el nombre de la columna lo permita (espacios, ...=

nombres = frame.Profesion
display(nombres)
type(nombres)

0    NaN
1    NaN
2    NaN
Name: Profesion, dtype: object

pandas.core.series.Series

In [29]:
print(frame['Nombre'][0])
print(frame.Nombre[0])
print(nombres[0])

Maria
Maria
nan

#### 4.0.1 Formas de crear un DataFrame

- Serie de pandas
- Lista de diccionarios
- Diccionario de Serie Pandas
- Con un array de Numpy bidimensional
- Con un array de NumPy

### 4.1 Modificar un DataFrame

In [30]:
# añadir columnas
diccionario = {"Nombre" : ["Maria" , "Laura" , "Daniel"] ,
              "Edad" : [34,29,12]}
frame = pd.DataFrame(diccionario, columns = ['Nacionalidad' , 'Nombre' , 'Edad' , 'Profesion' , 'Direccion'])
frame ['Direccion'] = 'Desconocida'
display(frame)

  Nacionalidad  Nombre  Edad Profesion    Direccion
0          NaN   Maria    34       NaN  Desconocida
1          NaN   Laura    29       NaN  Desconocida
2          NaN  Daniel    12       NaN  Desconocida

In [31]:
lista_direcciones = ['Rue 13 del Percebe, 13', 'Evergreen Terrace, 3', 'Av de los Rombos, 12']

In [32]:
frame['Direccion'] = lista_direcciones

display(frame)

  Nacionalidad  Nombre  Edad Profesion               Direccion
0          NaN   Maria    34       NaN  Rue 13 del Percebe, 13
1          NaN   Laura    29       NaN    Evergreen Terrace, 3
2          NaN  Daniel    12       NaN    Av de los Rombos, 12

In [33]:
#añadir una fila
user_2  = ['Alemania' , 'Klaus' , 20, 'none' , 'Desconocida']

frame.loc[3] = user_2
display(frame)

  Nacionalidad  Nombre  Edad Profesion               Direccion
0          NaN   Maria    34       NaN  Rue 13 del Percebe, 13
1          NaN   Laura    29       NaN    Evergreen Terrace, 3
2          NaN  Daniel    12       NaN    Av de los Rombos, 12
3     Alemania   Klaus    20      none             Desconocida

In [34]:
frame = pd.DataFrame(diccionario , columns =['Nacionalidad' , 'Nombre' , 'Edad',  'Profesion'])

frame = frame.drop(2)
display(frame)

frame.drop('Nombre' , axis=1, inplace=True)
display(frame)

  Nacionalidad Nombre  Edad Profesion
0          NaN  Maria    34       NaN
1          NaN  Laura    29       NaN

  Nacionalidad  Edad Profesion
0          NaN    34       NaN
1          NaN    29       NaN

In [35]:
#elimiar columna

del frame['Profesion']
display(frame)

  Nacionalidad  Edad
0          NaN    34
1          NaN    29

In [36]:
display(frame.T)

                0    1
Nacionalidad  NaN  NaN
Edad           34   29

### 4.2 Iteración

In [37]:
frame = pd.DataFrame(diccionario, columns = ['Nacionalidad' , 'Nombre' , 'Edad' , 'Profesion'])
display(frame)

for a in frame :
    print(a)
    print(type(a))

  Nacionalidad  Nombre  Edad Profesion
0          NaN   Maria    34       NaN
1          NaN   Laura    29       NaN
2          NaN  Daniel    12       NaN

Nacionalidad
<class 'str'>
Nombre
<class 'str'>
Edad
<class 'str'>
Profesion
<class 'str'>

In [38]:
# iteracion sobre filas
for value in frame.values:
    print(value)
    print(type(value))

[nan 'Maria' 34 nan]
<class 'numpy.ndarray'>
[nan 'Laura' 29 nan]
<class 'numpy.ndarray'>
[nan 'Daniel' 12 nan]
<class 'numpy.ndarray'>

In [40]:
# iterar sobre filas y luego sobre cada valor?
for values in frame.values:
    for value in values:
        print(value)

nan
Maria
34
nan
nan
Laura
29
nan
nan
Daniel
12
nan

## 4.3 Indexación y slicing con DataFrame

In [41]:
d1= {'ciudad' : 'Valencia' , 'temperatura' : 10, 'o2' : 1}
d2= {'ciudad' : 'Barcelona' , 'temperatura' : 8}
d3= {'ciudad' : 'Valencia' , 'temperatura' : 9}
d4= {'ciudad' : 'Madrid' , 'temperatura' :10, 'humedad' : 80}
d5= {'ciudad' : 'Sevilla' , 'temperatura' : 15 , 'humedad' : 50, 'co2' : 6}
d6= {'ciudad' : 'Valencia' , 'temperatura' :10 , 'humedad' : 90, 'co2' :10 }

ls_data = [d1,d2,d3,d4,d5,d6] #lista de diccionarios

df_data = pd.DataFrame(ls_data, index=list('abcdef'))
display(df_data)

      ciudad  temperatura   o2  humedad   co2
a   Valencia           10  1.0      NaN   NaN
b  Barcelona            8  NaN      NaN   NaN
c   Valencia            9  NaN      NaN   NaN
d     Madrid           10  NaN     80.0   NaN
e    Sevilla           15  NaN     50.0   6.0
f   Valencia           10  NaN     90.0  10.0

In [42]:
#Acesso a un valor en concreto por indice posicional

print(df_data.iloc[1,1])

display(df_data.iloc[3,4])
display(df_data.loc['a','temperatura'])
display(df_data.loc[:'c',:'o2'])
display(df_data.loc[:'c','temperatura' : 'o2'])
display(df_data.loc[:, ['ciudad' , 'o2']])

8

np.float64(nan)

np.int64(10)

      ciudad  temperatura   o2
a   Valencia           10  1.0
b  Barcelona            8  NaN
c   Valencia            9  NaN

   temperatura   o2
a           10  1.0
b            8  NaN
c            9  NaN

      ciudad   o2
a   Valencia  1.0
b  Barcelona  NaN
c   Valencia  NaN
d     Madrid  NaN
e    Sevilla  NaN
f   Valencia  NaN

In [43]:
print(df_data['ciudad'])
print(df_data[['ciudad','o2']])

a     Valencia
b    Barcelona
c     Valencia
d       Madrid
e      Sevilla
f     Valencia
Name: ciudad, dtype: object
      ciudad   o2
a   Valencia  1.0
b  Barcelona  NaN
c   Valencia  NaN
d     Madrid  NaN
e    Sevilla  NaN
f   Valencia  NaN

In [44]:
df_data[0]

KeyError: 0

In [45]:
print(df_data.iloc[0])

ciudad         Valencia
temperatura          10
o2                  1.0
humedad             NaN
co2                 NaN
Name: a, dtype: object

In [46]:
df_data.loc['a']

ciudad         Valencia
temperatura          10
o2                  1.0
humedad             NaN
co2                 NaN
Name: a, dtype: object

In [47]:
df_data.loc[:'b']

      ciudad  temperatura   o2  humedad  co2
a   Valencia           10  1.0      NaN  NaN
b  Barcelona            8  NaN      NaN  NaN

In [48]:
df_data.loc[:'b'].loc[:,["o2" , "humedad"]]

    o2  humedad
a  1.0      NaN
b  NaN      NaN

In [49]:
display(df_data)

serie = df_data.loc['a']
print(serie)

serie.iloc[2]
display(df_data)

df_2 = df_data.loc['a'].copy()

df_2.iloc[2]

display(df_2)
display(df_data)

      ciudad  temperatura   o2  humedad   co2
a   Valencia           10  1.0      NaN   NaN
b  Barcelona            8  NaN      NaN   NaN
c   Valencia            9  NaN      NaN   NaN
d     Madrid           10  NaN     80.0   NaN
e    Sevilla           15  NaN     50.0   6.0
f   Valencia           10  NaN     90.0  10.0

ciudad         Valencia
temperatura          10
o2                  1.0
humedad             NaN
co2                 NaN
Name: a, dtype: object

      ciudad  temperatura   o2  humedad   co2
a   Valencia           10  1.0      NaN   NaN
b  Barcelona            8  NaN      NaN   NaN
c   Valencia            9  NaN      NaN   NaN
d     Madrid           10  NaN     80.0   NaN
e    Sevilla           15  NaN     50.0   6.0
f   Valencia           10  NaN     90.0  10.0

ciudad         Valencia
temperatura          10
o2                  1.0
humedad             NaN
co2                 NaN
Name: a, dtype: object

      ciudad  temperatura   o2  humedad   co2
a   Valencia           10  1.0      NaN   NaN
b  Barcelona            8  NaN      NaN   NaN
c   Valencia            9  NaN      NaN   NaN
d     Madrid           10  NaN     80.0   NaN
e    Sevilla           15  NaN     50.0   6.0
f   Valencia           10  NaN     90.0  10.0

In [50]:
df_data.loc(axis=1) ['ciudad']

a     Valencia
b    Barcelona
c     Valencia
d       Madrid
e      Sevilla
f     Valencia
Name: ciudad, dtype: object

In [51]:
frame = pd.DataFrame({"Nombre" : ['Carlos', 'Pedro'] , "Edad": [34,22] },
                     index = [1,0])
display(frame)

   Nombre  Edad
1  Carlos    34
0   Pedro    22

In [52]:
print('Primera fila\n')

print(frame.iloc[0])

print('Elemento con Index\n')

print(frame.loc[0])

Primera fila

Nombre    Carlos
Edad          34
Name: 1, dtype: object
Elemento con Index

Nombre    Pedro
Edad         22
Name: 0, dtype: object

## 4.4 Objeto Index de Pandas

In [57]:
# construccion de indices
ind = pd.Index([2,3,5,23,26])

print(ind[3])
print(ind[::2])

23
Index([2, 5, 26], dtype='int64')

In [58]:
frame = pd.DataFrame({"Nombre" :  ['Carlos' , 'Pepe' , 'Manolo' , 'Luis' ,'Alberto'] , "Edad" :[34,22,15,55,23]} ,index = ind)

display(frame)

     Nombre  Edad
2    Carlos    34
3      Pepe    22
5    Manolo    15
23     Luis    55
26  Alberto    23

In [59]:
ind[3] = 8

TypeError: Index does not support mutable operations

In [61]:
frame = pd.DataFrame({"Nombre" : ['Carlos' , 'Pedro' ,'Manolo' , 'Luis' , 'Alberto'] , "Edad" : [34,22,15,55,23]} , index=ind)

display(frame)


frame.set_index('Edad' , inplace = True)

display(frame)

     Nombre  Edad
2    Carlos    34
3     Pedro    22
5    Manolo    15
23     Luis    55
26  Alberto    23

       Nombre
Edad
34     Carlos
22      Pedro
15     Manolo
55       Luis
23    Alberto

## 4.5 Slicing

In [64]:
#slice por filas

d_and_d_characters = {'Nombre' :['bundenth' , 'theorin' , 'barlok'] , 'Fuerza' : [10,12,19] , 'Sabiduria' : [20,13,6]}

character_data = pd.DataFrame(d_and_d_characters, index = ['a','b','c'])
display(character_data)
display(character_data[:-1])
display(character_data[1:2])

     Nombre  Fuerza  Sabiduria
a  bundenth      10         20
b   theorin      12         13
c    barlok      19          6

     Nombre  Fuerza  Sabiduria
a  bundenth      10         20
b   theorin      12         13

    Nombre  Fuerza  Sabiduria
b  theorin      12         13

In [65]:
#slicing por columna

display(character_data[['Nombre' , 'Sabiduria']])

     Nombre  Sabiduria
a  bundenth         20
b   theorin         13
c    barlok          6

In [67]:
# sliocing con iloc y loc

display(character_data.iloc[1:])
display(character_data.loc[:'b' , 'Nombre' : 'Fuerza'])

    Nombre  Fuerza  Sabiduria
b  theorin      12         13
c   barlok      19          6

     Nombre  Fuerza
a  bundenth      10
b   theorin      12

¿Cómo filtrar filas y columnas? Por ejemplo, para todos los personajes, obtener 'Nombre’ y ‘Fuerza’

In [69]:
#usando loc para buscar especificamente filas y columnas

display(character_data.loc[['a','c'] , ['Nombre' , 'Sabiduria']])

     Nombre  Sabiduria
a  bundenth         20
c    barlok          6

In [70]:
# lo mismo con iloc

display(character_data.iloc[[0,2] , [0,2]])
display(character_data.iloc[[0,-1] , [0,-1]])

     Nombre  Sabiduria
a  bundenth         20
c    barlok          6

     Nombre  Sabiduria
a  bundenth         20
c    barlok          6

In [74]:
# lista de los personajes con Fuerza > 15 o Sabiduria > 15

display(character_data.loc[(character_data['Fuerza'] > 15) | (character_data['Sabiduria'] > 15)])

     Nombre  Fuerza  Sabiduria
a  bundenth      10         20
c    barlok      19          6

## 5. Cargar y guardar datos en pandas

In [81]:
import os 
ruta = os.path.join("res" , 'o_d_d_characters.csv')
character_data.to_csv(ruta, sep=';')

In [83]:
loaded = pd.read_csv(ruta, sep= ';')
display(loaded)

  Unnamed: 0    Nombre  Fuerza  Sabiduria
0          a  bundenth      10         20
1          b   theorin      12         13
2          c    barlok      19          6

In [84]:
ruta = os.path.join("res" , "titanic.csv")

In [85]:
titanic = pd.read_csv(ruta, sep=',')
display(titanic)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [86]:
loaded = pd.read_csv(ruta,sep=',' , index_col=0)
display(loaded)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

***otros argumentos to_csv()**
- `na_resp='string'` --> representar valorrs NaN en el archivo csv

**otros argmunetos read_csv()**

- `na_values =='string'`

Puedes tambien ofrece funciones para leer/guardar a otros formatos estándares: JSON, HDF5 o Excel en su API

## 6. Ejemplo práctico en Pandas
- MovieLens dataset
- Reviews de películas
- 1 millón de entradas
- Datos demográficos de usuarios

In [87]:
import numpy as np
import pandas as pd
import zipfile
import urllib.request
import os

url = 'http://files.grouplens.org/datasets/movielens/ml-1m.zip'
ruta = os.path.join("res" , "ml-1m.zip")
urllib.request.urlretrieve(url,ruta)

('res\\ml-1m.zip', <http.client.HTTPMessage at 0x1d22673b590>)

In [88]:
ruta_ext = os.path.join("res")
with zipfile.ZipFile(ruta, 'r') as z :
    print('Extrayendo archivos...')
    z.extractall(ruta_ext)
    print("Finalizado con Exito!")

Extrayendo archivos...
Finalizado con Exito!

In [91]:
ruta_users = os.path.join("res" ,"ml-1m" , "users.dat")
users_dataset = pd.read_csv(ruta_users, sep='::' , index_col=0 , engine='python')
display(users_dataset)

      F  1.1  10  48067
1
2     M   56  16  70072
3     M   25  15  55117
4     M   45   7  02460
5     M   25  20  55455
6     F   50   9  55117
...  ..  ...  ..    ...
6036  F   25  15  32603
6037  F   45   1  76006
6038  F   56   1  14706
6039  F   45   0  01060
6040  M   25   6  11106

[6039 rows x 4 columns]

In [92]:
pd.read_csv?

Signature:
pd.read_csv(
    filepath_or_buffer: 'FilePath | ReadCsvBuffer[bytes] | ReadCsvBuffer[str]',
    *,
    sep: 'str | None | lib.NoDefault' = <no_default>,
    delimiter: 'str | None | lib.NoDefault' = None,
    header: "int | Sequence[int] | None | Literal['infer']" = 'infer',
    names: 'Sequence[Hashable] | None | lib.NoDefault' = <no_default>,
    index_col: 'IndexLabel | Literal[False] | None' = None,
    usecols: 'UsecolsArgType' = None,
    dtype: 'DtypeArg | None' = None,
    engine: 'CSVEngine | None' = None,
    converters: 'Mapping[Hashable, Callable] | None' = None,
    true_values: 'list | None' = None,
    false_values: 'list | None' = None,
    skipinitialspace: 'bool' = False,
    skiprows: 'list[int] | int | Callable[[Hashable], bool] | None' = None,
    skipfooter: 'int' = 0,
    nrows: 'int | None' = None,
    na_values: 'Hashable | Iterable[Hashable] | Mapping[Hashable, Iterable[Hashable]] | None' = None,
    keep_default_na: 'bool' = True,
    na_filter: 'bool' = True,
    verbose: 'bool | lib.NoDefault' = <no_default>,
    skip_blank_lines: 'bool' = True,
    parse_dates: 'bool | Sequence[Hashable] | None' = None,
    infer_datetime_format: 'bool | lib.NoDefault' = <no_default>,
    keep_date_col: 'bool | lib.NoDefault' = <no_default>,
    date_parser: 'Callable | lib.NoDefault' = <no_default>,
    date_format: 'str | dict[Hashable, str] | None' = None,
    dayfirst: 'bool' = False,
    cache_dates: 'bool' = True,
    iterator: 'bool' = False,
    chunksize: 'int | None' = None,
    compression: 'CompressionOptions' = 'infer',
    thousands: 'str | None' = None,
    decimal: 'str' = '.',
    lineterminator: 'str | None' = None,
    quotechar: 'str' = '"',
    quoting: 'int' = 0,
    doublequote: 'bool' = True,
    escapechar: 'str | None' = None,
    comment: 'str | None' = None,
    encoding: 'str | None' = None,
    encoding_errors: 'str | None' = 'strict',
    dialect: 'str | csv.Dialect | None' = None,
    on_bad_lines: 'str' = 'error',
    delim_whitespace: 'bool | lib.NoDefault' = <no_default>,
    low_memory: 'bool' = True,
    memory_map: 'bool' = False,
    float_precision: "Literal['high', 'legacy'] | None" = None,
    storage_options: 'StorageOptions | None' = None,
    dtype_backend: 'DtypeBackend | lib.NoDefault' = <no_default>,
) -> 'DataFrame | TextFileReader'
Docstring:
Read a comma-separated values (csv) file into DataFrame.

Also supports optionally iterating or breaking of the file
into chunks.

Additional help can be found in the online docs for
`IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

Parameters
----------
filepath_or_buffer : str, path object or file-like object
    Any valid string path is acceptable. The string could be a URL. Valid
    URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
    expected. A local file could be: file://localhost/path/to/table.csv.

    If you want to pass in a path object, pandas accepts any ``os.PathLike``.

    By file-like object, we refer to objects with a ``read()`` method, such as
    a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
sep : str, default ','
    Character or regex pattern to treat as the delimiter. If ``sep=None``, the
    C engine cannot automatically detect
    the separator, but the Python parsing engine can, meaning the latter will
    be used and automatically detect the separator from only the first valid
    row of the file by Python's builtin sniffer tool, ``csv.Sniffer``.
    In addition, separators longer than 1 character and different from
    ``'\s+'`` will be interpreted as regular expressions and will also force
    the use of the Python parsing engine. Note that regex delimiters are prone
    to ignoring quoted data. Regex example: ``'\r\t'``.
delimiter : str, optional
    Alias for ``sep``.
header : int, Sequence of int, 'infer' or None, default 'infer'
    Row number(s) containing column labels and marking the start of the
    data (zero-indexed). Default behavior is to infer the column names: if no ``names``
    are passed the behavior is identical to ``header=0`` and column
    names are inferred from the first line of the file, if column
    names are passed explicitly to ``names`` then the behavior is identical to
    ``header=None``. Explicitly pass ``header=0`` to be able to
    replace existing names. The header can be a list of integers that
    specify row locations for a :class:`~pandas.MultiIndex` on the columns
    e.g. ``[0, 1, 3]``. Intervening rows that are not specified will be
    skipped (e.g. 2 in this example is skipped). Note that this
    parameter ignores commented lines and empty lines if
    ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
    data rather than the first line of the file.
names : Sequence of Hashable, optional
    Sequence of column labels to apply. If the file contains a header row,
    then you should explicitly pass ``header=0`` to override the column names.
    Duplicates in this list are not allowed.
index_col : Hashable, Sequence of Hashable or False, optional
  Column(s) to use as row label(s), denoted either by column labels or column
  indices.  If a sequence of labels or indices is given, :class:`~pandas.MultiIndex`
  will be formed for the row labels.

  Note: ``index_col=False`` can be used to force pandas to *not* use the first
  column as the index, e.g., when you have a malformed file with delimiters at
  the end of each line.
usecols : Sequence of Hashable or Callable, optional
    Subset of columns to select, denoted either by column labels or column indices.
    If list-like, all elements must either
    be positional (i.e. integer indices into the document columns) or strings
    that correspond to column names provided either by the user in ``names`` or
    inferred from the document header row(s). If ``names`` are given, the document
    header row(s) are not taken into account. For example, a valid list-like
    ``usecols`` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
    Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
    To instantiate a :class:`~pandas.DataFrame` from ``data`` with element order
    preserved use ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]``
    for columns in ``['foo', 'bar']`` order or
    ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
    for ``['bar', 'foo']`` order.

    If callable, the callable function will be evaluated against the column
    names, returning names where the callable function evaluates to ``True``. An
    example of a valid callable argument would be ``lambda x: x.upper() in
    ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
    parsing time and lower memory usage.
dtype : dtype or dict of {Hashable : dtype}, optional
    Data type(s) to apply to either the whole dataset or individual columns.
    E.g., ``{'a': np.float64, 'b': np.int32, 'c': 'Int64'}``
    Use ``str`` or ``object`` together with suitable ``na_values`` settings
    to preserve and not interpret ``dtype``.
    If ``converters`` are specified, they will be applied INSTEAD
    of ``dtype`` conversion.

    .. versionadded:: 1.5.0

        Support for ``defaultdict`` was added. Specify a ``defaultdict`` as input where
        the default determines the ``dtype`` of the columns which are not explicitly
        listed.
engine : {'c', 'python', 'pyarrow'}, optional
    Parser engine to use. The C and pyarrow engines are faster, while the python engine
    is currently more feature-complete. Multithreading is currently only supported by
    the pyarrow engine.

    .. versionadded:: 1.4.0

        The 'pyarrow' engine was added as an *experimental* engine, and some features
        are unsupported, or may not work correctly, with this engine.
converters : dict of {Hashable : Callable}, optional
    Functions for converting values in specified columns. Keys can either
    be column labels or column indices.
true_values : list, optional
    Values to consider as ``True`` in addition to case-insensitive variants of 'True'.
false_values : list, optional
    Values to consider as ``False`` in addition to case-insensitive variants of 'False'.
skipinitialspace : bool, default False
    Skip spaces after delimiter.
skiprows : int, list of int or Callable, optional
    Line numbers to skip (0-indexed) or number of lines to skip (``int``)
    at the start of the file.

    If callable, the callable function will be evaluated against the row
    indices, returning ``True`` if the row should be skipped and ``False`` otherwise.
    An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
skipfooter : int, default 0
    Number of lines at bottom of file to skip (Unsupported with ``engine='c'``).
nrows : int, optional
    Number of rows of file to read. Useful for reading pieces of large files.
na_values : Hashable, Iterable of Hashable or dict of {Hashable : Iterable}, optional
    Additional strings to recognize as ``NA``/``NaN``. If ``dict`` passed, specific
    per-column ``NA`` values.  By default the following values are interpreted as
    ``NaN``: " ", "#N/A", "#N/A N/A", "#NA", "-1.#IND", "-1.#QNAN", "-NaN", "-nan",
    "1.#IND", "1.#QNAN", "<NA>", "N/A", "NA", "NULL", "NaN", "None",
    "n/a", "nan", "null ".

keep_default_na : bool, default True
    Whether or not to include the default ``NaN`` values when parsing the data.
    Depending on whether ``na_values`` is passed in, the behavior is as follows:

    * If ``keep_default_na`` is ``True``, and ``na_values`` are specified, ``na_values``
      is appended to the default ``NaN`` values used for parsing.
    * If ``keep_default_na`` is ``True``, and ``na_values`` are not specified, only
      the default ``NaN`` values are used for parsing.
    * If ``keep_default_na`` is ``False``, and ``na_values`` are specified, only
      the ``NaN`` values specified ``na_values`` are used for parsing.
    * If ``keep_default_na`` is ``False``, and ``na_values`` are not specified, no
      strings will be parsed as ``NaN``.

    Note that if ``na_filter`` is passed in as ``False``, the ``keep_default_na`` and
    ``na_values`` parameters will be ignored.
na_filter : bool, default True
    Detect missing value markers (empty strings and the value of ``na_values``). In
    data without any ``NA`` values, passing ``na_filter=False`` can improve the
    performance of reading a large file.
verbose : bool, default False
    Indicate number of ``NA`` values placed in non-numeric columns.

    .. deprecated:: 2.2.0
skip_blank_lines : bool, default True
    If ``True``, skip over blank lines rather than interpreting as ``NaN`` values.
parse_dates : bool, list of Hashable, list of lists or dict of {Hashable : list}, default False
    The behavior is as follows:

    * ``bool``. If ``True`` -> try parsing the index. Note: Automatically set to
      ``True`` if ``date_format`` or ``date_parser`` arguments have been passed.
    * ``list`` of ``int`` or names. e.g. If ``[1, 2, 3]`` -> try parsing columns 1, 2, 3
      each as a separate date column.
    * ``list`` of ``list``. e.g.  If ``[[1, 3]]`` -> combine columns 1 and 3 and parse
      as a single date column. Values are joined with a space before parsing.
    * ``dict``, e.g. ``{'foo' : [1, 3]}`` -> parse columns 1, 3 as date and call
      result 'foo'. Values are joined with a space before parsing.

    If a column or index cannot be represented as an array of ``datetime``,
    say because of an unparsable value or a mixture of timezones, the column
    or index will be returned unaltered as an ``object`` data type. For
    non-standard ``datetime`` parsing, use :func:`~pandas.to_datetime` after
    :func:`~pandas.read_csv`.

    Note: A fast-path exists for iso8601-formatted dates.
infer_datetime_format : bool, default False
    If ``True`` and ``parse_dates`` is enabled, pandas will attempt to infer the
    format of the ``datetime`` strings in the columns, and if it can be inferred,
    switch to a faster method of parsing them. In some cases this can increase
    the parsing speed by 5-10x.

    .. deprecated:: 2.0.0
        A strict version of this argument is now the default, passing it has no effect.

keep_date_col : bool, default False
    If ``True`` and ``parse_dates`` specifies combining multiple columns then
    keep the original columns.
date_parser : Callable, optional
    Function to use for converting a sequence of string columns to an array of
    ``datetime`` instances. The default uses ``dateutil.parser.parser`` to do the
    conversion. pandas will try to call ``date_parser`` in three different ways,
    advancing to the next if an exception occurs: 1) Pass one or more arrays
    (as defined by ``parse_dates``) as arguments; 2) concatenate (row-wise) the
    string values from the columns defined by ``parse_dates`` into a single array
    and pass that; and 3) call ``date_parser`` once for each row using one or
    more strings (corresponding to the columns defined by ``parse_dates``) as
    arguments.

    .. deprecated:: 2.0.0
       Use ``date_format`` instead, or read in as ``object`` and then apply
       :func:`~pandas.to_datetime` as-needed.
date_format : str or dict of column -> format, optional
    Format to use for parsing dates when used in conjunction with ``parse_dates``.
    The strftime to parse time, e.g. :const:`"%d/%m/%Y"`. See
    `strftime documentation
    <https://docs.python.org/3/library/datetime.html
    #strftime-and-strptime-behavior>`_ for more information on choices, though
    note that :const:`"%f"` will parse all the way up to nanoseconds.
    You can also pass:

    - "ISO8601", to parse any `ISO8601 <https://en.wikipedia.org/wiki/ISO_8601>`_
        time string (not necessarily in exactly the same format);
    - "mixed", to infer the format for each element individually. This is risky,
        and you should probably use it along with `dayfirst`.

    .. versionadded:: 2.0.0
dayfirst : bool, default False
    DD/MM format dates, international and European format.
cache_dates : bool, default True
    If ``True``, use a cache of unique, converted dates to apply the ``datetime``
    conversion. May produce significant speed-up when parsing duplicate
    date strings, especially ones with timezone offsets.

iterator : bool, default False
    Return ``TextFileReader`` object for iteration or getting chunks with
    ``get_chunk()``.
chunksize : int, optional
    Number of lines to read from the file per chunk. Passing a value will cause the
    function to return a ``TextFileReader`` object for iteration.
    See the `IO Tools docs
    <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
    for more information on ``iterator`` and ``chunksize``.

compression : str or dict, default 'infer'
    For on-the-fly decompression of on-disk data. If 'infer' and 'filepath_or_buffer' is
    path-like, then detect compression from the following extensions: '.gz',
    '.bz2', '.zip', '.xz', '.zst', '.tar', '.tar.gz', '.tar.xz' or '.tar.bz2'
    (otherwise no compression).
    If using 'zip' or 'tar', the ZIP file must contain only one data file to be read in.
    Set to ``None`` for no decompression.
    Can also be a dict with key ``'method'`` set
    to one of {``'zip'``, ``'gzip'``, ``'bz2'``, ``'zstd'``, ``'xz'``, ``'tar'``} and
    other key-value pairs are forwarded to
    ``zipfile.ZipFile``, ``gzip.GzipFile``,
    ``bz2.BZ2File``, ``zstandard.ZstdDecompressor``, ``lzma.LZMAFile`` or
    ``tarfile.TarFile``, respectively.
    As an example, the following could be passed for Zstandard decompression using a
    custom compression dictionary:
    ``compression={'method': 'zstd', 'dict_data': my_compression_dict}``.

    .. versionadded:: 1.5.0
        Added support for `.tar` files.

    .. versionchanged:: 1.4.0 Zstandard support.

thousands : str (length 1), optional
    Character acting as the thousands separator in numerical values.
decimal : str (length 1), default '.'
    Character to recognize as decimal point (e.g., use ',' for European data).
lineterminator : str (length 1), optional
    Character used to denote a line break. Only valid with C parser.
quotechar : str (length 1), optional
    Character used to denote the start and end of a quoted item. Quoted
    items can include the ``delimiter`` and it will be ignored.
quoting : {0 or csv.QUOTE_MINIMAL, 1 or csv.QUOTE_ALL, 2 or csv.QUOTE_NONNUMERIC, 3 or csv.QUOTE_NONE}, default csv.QUOTE_MINIMAL
    Control field quoting behavior per ``csv.QUOTE_*`` constants. Default is
    ``csv.QUOTE_MINIMAL`` (i.e., 0) which implies that only fields containing special
    characters are quoted (e.g., characters defined in ``quotechar``, ``delimiter``,
    or ``lineterminator``.
doublequote : bool, default True
   When ``quotechar`` is specified and ``quoting`` is not ``QUOTE_NONE``, indicate
   whether or not to interpret two consecutive ``quotechar`` elements INSIDE a
   field as a single ``quotechar`` element.
escapechar : str (length 1), optional
    Character used to escape other characters.
comment : str (length 1), optional
    Character indicating that the remainder of line should not be parsed.
    If found at the beginning
    of a line, the line will be ignored altogether. This parameter must be a
    single character. Like empty lines (as long as ``skip_blank_lines=True``),
    fully commented lines are ignored by the parameter ``header`` but not by
    ``skiprows``. For example, if ``comment='#'``, parsing
    ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in ``'a,b,c'`` being
    treated as the header.
encoding : str, optional, default 'utf-8'
    Encoding to use for UTF when reading/writing (ex. ``'utf-8'``). `List of Python
    standard encodings
    <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .

encoding_errors : str, optional, default 'strict'
    How encoding errors are treated. `List of possible values
    <https://docs.python.org/3/library/codecs.html#error-handlers>`_ .

    .. versionadded:: 1.3.0

dialect : str or csv.Dialect, optional
    If provided, this parameter will override values (default or not) for the
    following parameters: ``delimiter``, ``doublequote``, ``escapechar``,
    ``skipinitialspace``, ``quotechar``, and ``quoting``. If it is necessary to
    override values, a ``ParserWarning`` will be issued. See ``csv.Dialect``
    documentation for more details.
on_bad_lines : {'error', 'warn', 'skip'} or Callable, default 'error'
    Specifies what to do upon encountering a bad line (a line with too many fields).
    Allowed values are :

    - ``'error'``, raise an Exception when a bad line is encountered.
    - ``'warn'``, raise a warning when a bad line is encountered and skip that line.
    - ``'skip'``, skip bad lines without raising or warning when they are encountered.

    .. versionadded:: 1.3.0

    .. versionadded:: 1.4.0

        - Callable, function with signature
          ``(bad_line: list[str]) -> list[str] | None`` that will process a single
          bad line. ``bad_line`` is a list of strings split by the ``sep``.
          If the function returns ``None``, the bad line will be ignored.
          If the function returns a new ``list`` of strings with more elements than
          expected, a ``ParserWarning`` will be emitted while dropping extra elements.
          Only supported when ``engine='python'``

    .. versionchanged:: 2.2.0

        - Callable, function with signature
          as described in `pyarrow documentation
          <https://arrow.apache.org/docs/python/generated/pyarrow.csv.ParseOptions.html
          #pyarrow.csv.ParseOptions.invalid_row_handler>`_ when ``engine='pyarrow'``

delim_whitespace : bool, default False
    Specifies whether or not whitespace (e.g. ``' '`` or ``'\t'``) will be

In [94]:
users_dataset = pd.read_csv(ruta_users , sep='::' , index_col=0, header=None, names = ['UserID' , 'Género' , 'Edad' , 'Ocupación' , 'Zip-Code'] , engine='python')
display(users_dataset)

       Género  Edad  Ocupación Zip-Code
UserID
1           F     1         10    48067
2           M    56         16    70072
3           M    25         15    55117
4           M    45          7    02460
5           M    25         20    55455
...       ...   ...        ...      ...
6036        F    25         15    32603
6037        F    45          1    76006
6038        F    56          1    14706
6039        F    45          0    01060
6040        M    25          6    11106

[6040 rows x 4 columns]

In [95]:
display(users_dataset.sample(10))

       Género  Edad  Ocupación Zip-Code
UserID
2298        M    35         17    77584
1854        M    25          0    92346
4788        M    35          7    85331
2675        M    35         18    98664
3752        F    18          1    86314
4189        M    35         14    91364
2886        M    18          4    60073
5477        M    35          1    55343
4547        M    18         12    02115
4951        F    35         17    90291

In [96]:
display(users_dataset.head(4))

       Género  Edad  Ocupación Zip-Code
UserID
1           F     1         10    48067
2           M    56         16    70072
3           M    25         15    55117
4           M    45          7    02460

In [97]:
display(users_dataset.tail(10))

       Género  Edad  Ocupación Zip-Code
UserID
6031        F    18          0    45123
6032        M    45          7    55108
6033        M    50         13    78232
6034        M    25         14    94117
6035        F    25          1    78734
6036        F    25         15    32603
6037        F    45          1    76006
6038        F    56          1    14706
6039        F    45          0    01060
6040        M    25          6    11106

In [98]:
users_dataset.dtypes

Género       object
Edad          int64
Ocupación     int64
Zip-Code     object
dtype: object

In [100]:
display(users_dataset[users_dataset['Zip-Code'].str.len() > 5])

       Género  Edad  Ocupación    Zip-Code
UserID
161         M    45         16  98107-2117
233         F    45         20  37919-4204
293         M    56          1  55337-4056
458         M    50         16  55405-2546
506         M    25         16  55103-1006
...       ...   ...        ...         ...
5682        M    18          0  23455-4959
5904        F    45         12      954025
5925        F    25          0  90035-4444
5967        M    50         16  73069-5429
5985        F    18          4  78705-5221

[81 rows x 4 columns]

In [101]:
display(users_dataset.describe())

              Edad    Ocupación
count  6040.000000  6040.000000
mean     30.639238     8.146854
std      12.895962     6.329511
min       1.000000     0.000000
25%      25.000000     3.000000
50%      25.000000     7.000000
75%      35.000000    14.000000
max      56.000000    20.000000

In [102]:
users_dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6040 entries, 1 to 6040
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Género     6040 non-null   object
 1   Edad       6040 non-null   int64
 2   Ocupación  6040 non-null   int64
 3   Zip-Code   6040 non-null   object
dtypes: int64(2), object(2)
memory usage: 235.9+ KB

In [103]:
display(users_dataset.describe(include='all'))

       Género         Edad    Ocupación Zip-Code
count    6040  6040.000000  6040.000000     6040
unique      2          NaN          NaN     3439
top         M          NaN          NaN    48104
freq     4331          NaN          NaN       19
mean      NaN    30.639238     8.146854      NaN
std       NaN    12.895962     6.329511      NaN
min       NaN     1.000000     0.000000      NaN
25%       NaN    25.000000     3.000000      NaN
50%       NaN    25.000000     7.000000      NaN
75%       NaN    35.000000    14.000000      NaN
max       NaN    56.000000    20.000000      NaN

In [105]:
len(users_dataset[users_dataset['Género'] == 'F'])

1709

In [106]:
under_age = users_dataset[users_dataset['Edad'] == 1]
print(len(under_age))
display(under_age.sample(10))

222

       Género  Edad  Ocupación Zip-Code
UserID
1353        M     1         10    95926
5414        M     1         10    07652
4787        M     1         11    94610
5953        M     1         10    21030
940         M     1         10    76240
4997        M     1         10    90210
2244        M     1         10    60565
51          F     1         10    10562
2687        M     1         10    08805
762         M     1         10    63041

In [108]:
users_dataset = pd.read_csv(ruta_users, sep='::', index_col=0,
header=None, names=['UserID','Género','Edad','Ocupación','Zip-Code'], engine='python')
under_age = users_dataset[users_dataset['Edad'] == 1]
under_age.loc['Edad'] = np.nan
display(under_age.head())

C:\Users\USER\AppData\Local\Temp\ipykernel_19640\1474881254.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  under_age.loc['Edad'] = np.nan

       Género  Edad  Ocupación Zip-Code
UserID
1           F   1.0       10.0    48067
19          M   1.0       10.0    48073
51          F   1.0       10.0    10562
75          F   1.0       10.0    01748
86          F   1.0       10.0    54467

In [110]:
users_dataset = pd.read_csv(ruta_users, sep='::', index_col=0, header=None, names=['UserID','Género','Edad','Ocupación','Zip-Code'], engine='python')
under_age = users_dataset[users_dataset['Edad'] == 1]
under_age_copy = under_age.copy()
display(under_age_copy.head())
under_age_copy['Edad'] = np.nan
display(under_age_copy.head())
users_dataset[users_dataset['Edad'] == 1] = under_age_copy # sets the rows according to the indexes
display(users_dataset.head())

       Género  Edad  Ocupación Zip-Code
UserID
1           F     1         10    48067
19          M     1         10    48073
51          F     1         10    10562
75          F     1         10    01748
86          F     1         10    54467

       Género  Edad  Ocupación Zip-Code
UserID
1           F   NaN         10    48067
19          M   NaN         10    48073
51          F   NaN         10    10562
75          F   NaN         10    01748
86          F   NaN         10    54467

       Género  Edad  Ocupación Zip-Code
UserID
1           F   NaN         10    48067
2           M  56.0         16    70072
3           M  25.0         15    55117
4           M  45.0          7    02460
5           M  25.0         20    55455

In [111]:
users_dataset = pd.read_csv(ruta_users, sep='::', index_col=0,
header=None, names=['UserID','Género','Edad','Ocupación','Zip-Code'], engine='python')
display(users_dataset[users_dataset['Edad'] == 1].head(4))
users_dataset.loc[users_dataset['Edad'] == 1, 'Edad'] = np.nan
display(users_dataset)
display(users_dataset.loc[pd.isnull(users_dataset['Edad'])].head(4))
users_dataset.drop(users_dataset[pd.isnull(users_dataset['Edad'])].index, inplace = True)
display(users_dataset.head(4))

       Género  Edad  Ocupación Zip-Code
UserID
1           F     1         10    48067
19          M     1         10    48073
51          F     1         10    10562
75          F     1         10    01748

       Género  Edad  Ocupación Zip-Code
UserID
1           F   NaN         10    48067
2           M  56.0         16    70072
3           M  25.0         15    55117
4           M  45.0          7    02460
5           M  25.0         20    55455
...       ...   ...        ...      ...
6036        F  25.0         15    32603
6037        F  45.0          1    76006
6038        F  56.0          1    14706
6039        F  45.0          0    01060
6040        M  25.0          6    11106

[6040 rows x 4 columns]

       Género  Edad  Ocupación Zip-Code
UserID
1           F   NaN         10    48067
19          M   NaN         10    48073
51          F   NaN         10    10562
75          F   NaN         10    01748

       Género  Edad  Ocupación Zip-Code
UserID
2           M  56.0         16    70072
3           M  25.0         15    55117
4           M  45.0          7    02460
5           M  25.0         20    55455

In [113]:
display(users_dataset.groupby(by='Género').describe())

          Edad                                                     Ocupación  \
         count       mean        std   min   25%   50%   75%   max     count
Género
F       1631.0  32.287554  11.792015  18.0  25.0  25.0  45.0  56.0    1631.0
M       4187.0  31.568665  11.716053  18.0  25.0  25.0  35.0  56.0    4187.0


            mean       std  min  25%  50%   75%   max
Género
F       6.498467  5.960285  0.0  1.0  4.0  11.0  20.0
M       8.743253  6.441753  0.0  4.0  7.0  15.0  20.0

In [114]:
ruta_output = os.path.join('res', 'ml-1m', 'o_users_processed.csv')
users_dataset.to_csv(ruta_output, sep=',',na_rep='null')

## 7. Ejercicios

2. Imprimir la version de pandas que se ha importado
4. Crear un DataFrame del diccionario data que tiene los indices `labels`
6. Retornar las 3 primeras filas de el DataFrame `df`
8. Seleccionar los datos de las filas `[3,4,8]` and en las columnas `[animal , 'age']`
10. Selcciona las filas donde la edad sea NaN
12. Selecciona las filas donde la edad este entre 2 y 4 (incluidos ambos)
14. Calcula la suma de todas las visitas en `df`
16. Añade una nueva fila `k` a `df` con los valores de cada colmna a tu elección. Luego, elimna esa fila par volver al DataFrame original
18. Ordena `df` primero por los valores de `age` en orden descendente, luego, por el valor  de  la columna `visits` en orden ascendente
20. En la colmna `animal` change la 'serpiente a 'python'

## Solución
2.

In [115]:
pd.__version__

'2.3.3'

4.

In [117]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)
display(df)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

6.

In [118]:
display(df.head(3))

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

8.

In [119]:
df.loc[['d', 'e', 'i'], ['animal', 'age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

10.

In [120]:
df[df['age'].isna()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

12.

In [121]:
df[df['age'].between(2, 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

14.

In [122]:
df['visits'].sum()

np.int64(19)

16.

In [123]:
df.loc['k'] = ['python', 6, 4, 'yes']
display(df)
# Eliminarla para volver al DataFrame original
df = df.drop('k')
display(df)

   animal  age  visits priority
a     cat  2.5       1      yes
b     cat  3.0       3      yes
c   snake  0.5       2       no
d     dog  NaN       3      yes
e     dog  5.0       2       no
f     cat  2.0       3       no
g   snake  4.5       1       no
h     cat  NaN       1      yes
i     dog  7.0       2       no
j     dog  3.0       1       no
k  python  6.0       4      yes

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

18.

In [124]:
df.sort_values(by=['age', 'visits'], ascending=[False, True])

  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
j    dog  3.0       1       no
b    cat  3.0       3      yes
a    cat  2.5       1      yes
f    cat  2.0       3       no
c  snake  0.5       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

20.

In [127]:
df['animal'] = df['animal'].replace('snake', 'python')
display(df)

   animal  age  visits priority
a     cat  2.5       1      yes
b     cat  3.0       3      yes
c  python  0.5       2       no
d     dog  NaN       3      yes
e     dog  5.0       2       no
f     cat  2.0       3       no
g  python  4.5       1       no
h     cat  NaN       1      yes
i     dog  7.0       2       no
j     dog  3.0       1       no

Repositorio en GitHub: https://github.com/EstebanSan140106/machine-2.git